# MinTreadDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..MinTreadDepth Property
StairsType Class See Also
---
The minimum tread width along the center path for all common runs (winder, arc, and straight).
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MinTreadDepth { get; set; }
```

Visual Basic
---
```text
Public Property MinTreadDepth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinTreadDepth {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for minTreadDepth must be greater than 0 and no more than 30000 feet. |

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace